<?php

return [
    'message'          => 'تنها پیغام قابل قبول است',
    'text'             => 'تنها پیغام متنی قابل قبول است',
    'text-single-line' => 'تنها متن تک خطی قابل قبول است',
    'int'              => 'تنها عدد صحیح قابل قبول است',
    'float'            => 'تنها عدد قابل قبول است',
    'unsigned-int'     => 'تنها عدد صحیح مثبت قابل قبول است',
    'unsigned-float'   => 'تنها عدد مثبت قابل قبول است',
    'numeric'          => 'تنها عدد قابل قبول است',
    'media'            => 'تنها پیغام رسانه ای قابل قبول است‌ (عکس/ویدیو/...)',
    'media-or-text'    => 'تنها پیغام متنی یا رسانه ای قابل قبول است (عکس/ویدیو/...)',
    'should-forward'   => 'پیغام باید فوروارد شده باشد',
    'not-forward'      => 'پیغام نباید فوروارد شده باشد',

    'min'        => 'حداقل عدد قابل قبول :number است',
    'max'        => 'حداکثر عدد قابل قبول :number است',
    'min-length' => 'حداقل طول متن قابل قبول :length است',
    'max-length' => 'حداکثر طول متن قابل قبول :length است',
    'divisible'  => 'عدد شما باید مضربی از :number باشد',

    'string-able' => 'تنها متن قابل قبول است',
    'pattern'     => 'پیغام نامعتبر است',

    'exists' => 'این آیتم وجود ندارد',
    'unique' => 'این آیتم از قبل وجود دارد',
];
